const workHistory = [
  {
    companyName: "ООО Ндиагностик",
    role: "Инженер-программист",
    duration: "Сентябрь 2022 — по настоящее время",
    workDes: [
      "разработка пользовательских интерфейсов с использованием Vue, Vuetify, Vuex",
      "добавление новой функциональности",
      "улучшение старой функциональности",
      "исправление багов",
      "взаимодействие с серверной частью веб-приложения",
    ],
    exposer: [
      "React",
      "Redux Saga ",
      "NodeJs",
      "ExpressJs",
      "MongoDB",
      "Heroku",
      "Twitter API’s",
      "LinkedIn API",
    ],
    link: "#",
  },
  {
    companyName: "SIMETRA «А+С Транспроект»",
    role: "Frontend developer",
    duration: "Июнь 2022 — июль 2022",
    workDes: [
      "написание нового и улучшения старого функционала",
      "написание технической документации",
      "создание базового дизайна",
      "верстка и адаптив для главной страницы",
      "написание скриптов по взаимодействию с новыми процессорами",
      "фронтенд-скелет всего проекта",
      "другие мелкие настройки интерфейса",
    ],
    exposer: ["React ", "NodeJs", "MongoDB", "ContextAPI"],
    link: "#",
  },
  {
    companyName: "SIMETRA «А+С Транспроект»",
    role: "Frontend developer",
    duration: "Февраль 2022 — май 2022",
    workDes: [
      "визуализация модели города",
      "визуализация на странице аналитики",
      "верстка и адаптив для начальной версии главной страницы",
      "фронтенд-скелет всего проекта",
      "верстка и адаптив для страниц 'аналитики', 'методологии' и 'настройки'",
      "много других мелких настроек интерфейса",
    ],
    exposer: ["React ", "NodeJs", "MongoDB", "ContextAPI"],
    link: "#",
  },
];

export default workHistory;
