const workHistory = [
  {
    companyName: "ООО Ндиагностик",
    role: "Инженер-программист",
    duration: "Сентябрь 2022 — по настоящее время (11 месяцев)",
    workDes: [
      "разработка пользовательского интерфейа с использованием экосистемы React",
      "написание нового и улучшение существующего функционала",
      "проектирование новых компонентов",
      "декомпозирование кода и улучшение читаемости",
      "исправление багов",
      "участие в выборе технологий",
      "адаптивная верстка",
      "взаимодействие с серверной частью веб-приложения"
    ],
    exposer: ["React"],
    link: "#",
  },
  {
    companyName: "SIMETRA «А+С Транспроект»",
    role: "Frontend developer",
    duration: "Февраль 2022 — июль 2022 (6 месяцев)",
    workDes: [
      "проектирование логики всего проекта",
      "адаптивная верстка",
      "обработка данных и их визуализация с помощью библиотеки Chart.js",
      "разработка проекта с нуля",
      "участие в выборе технологий",
      "написание нового и улучшение существующего функционала",
      "написание технической документации",
      "создание дизайна",
      "работа с графикой с помощью библиотеки Go.js",
      "написание скриптов по взаимодействию с новыми процессорами",
      "работа с внешними API",
    ],
    exposer: ["HTML ", "SCSS", "JavaScript", "Chart.js", "Go.js"],
    link: "https://simetragroup.ru/",
  },
];

export default workHistory;
